Revit 2027 API
FabricationConfiguration.HasValidConfiguration Method
 Checks whether a valid fabrication configuration has been set for the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidConfiguration()
Public Function HasValidConfiguration As Boolean
public:
bool HasValidConfiguration()
member HasValidConfiguration : unit -> bool
Return Value
Boolean
 True if a valid fabrication configuration has been set for the project.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace